# Taps
tap 'homebrew/cask-versions'
tap 'danielfrg/formulas'

# Core
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'gnu-sed'
# brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-tar'
brew 'grep'

# Fancy CLI stuff
brew 'zsh'
brew 'fzf'
brew 'bat'
brew 'entr'
brew 'htop'
brew 'diff-so-fancy'
brew 'prettyping'
brew 'the_silver_searcher'
brew 'trash'
brew 'thefuck'
brew 'watch'
brew 'autojump'
brew 'tldr'
brew 'jq'
brew 'mobile-shell'
brew 'sshrc'
brew 'rmtrash'
brew 'ruby'

# Install download utilities.
brew 'wget'
brew 'curl'
# brew 'curl', args: ['with-openssl']
brew 'httpie'
brew 'youtube-dl'
brew 'wireguard-tools'

# General dev
brew 'neovim'
brew 'gnupg'
brew 'git'
brew 'hub'
brew 'tmux'
brew 'direnv'
brew 'unp'
brew 'terraform'
brew 'pandoc'
brew 'hugo'

# Languages
brew 'go'
brew 'dep'
brew 'node'
brew 'yarn'

# k8s
brew 'kubectx'
brew 'kube-ps1'
brew 'kubernetes-helm'
# brew 'kubefwd'
# brew 'draft'

# Others
brew 'ffmpeg'

###################
# Casks
###################

cask '1password'
cask 'brave-browser'
cask 'google-chrome'
cask 'firefox'
cask 'keyboard-maestro7'
cask 'notion'
cask 'evernote'
cask 'alfred'
cask 'clipy'
cask 'keka'
cask 'spotify'
cask 'silverlight'
cask 'windscribe'
cask 'calibre'
cask 'send-to-kindle'
cask 'homebrew/cask-drivers/logitech-options'
cask 'vlc'
cask 'caption'

cask 'iterm2'
cask 'visual-studio-code'
cask 'java'
cask 'adoptopenjdk8'
cask 'docker'
cask 'vagrant'
cask 'virtualbox'
cask 'insomia'
cask 'google-cloud-sdk'
cask 'slack'
cask 'xquartz'
cask 'ngrok'
cask 'gpg-suite'
cask 'keybase'
