brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'atuin'
brew 'ansible'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'cloudflared'
brew 'curl'
brew 'duckdb'
brew 'docker'
brew 'docker-buildx'
brew 'colima'
brew 'eza'
brew 'fd'
brew 'fileicon'
brew 'fish'
brew 'ffmpeg'
brew 'fzf'
brew 'git'
brew 'git-delta'
brew 'gh'
brew 'gpg2'
brew 'gnupg'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'goku'
brew 'grep'
brew 'helm'
brew 'httpie'
brew 'just'
brew 'jq'
brew 'kubecolor'
brew 'kubectl'
brew 'lazygit'
brew 'libpq'
brew 'neofetch'
brew 'neovim'
brew 'openssl'
brew 'pinentry-mac'
brew 'protobuf'
brew 'rename'
brew 'ripgrep'
brew 'rsync'
brew 'starship'
brew 'stow'
brew 'telnet'
brew 'terraform'
brew 'tmux'
brew 'trash-cli'
brew 'volta'
brew 'watch'
brew 'wget'
brew 'yamlfmt'
brew 'yazi'
brew 'zsh'
brew 'zoxide'

tap 'nikitabobko/tap'
cask 'nikitabobko/tap/aerospace'

###################
# Casks

cask 'aerospace'
cask 'audacity'
cask 'cleanshot'
cask 'discord'
# cask 'docker'
cask 'firefox'
# cask 'google-chrome'
cask 'google-drive'
cask 'gpg-suite'
cask 'hammerspoon'
cask 'httpie'
cask 'jordanbaird-ice'
cask 'karabiner-elements'
cask 'monitorcontrol'
cask 'obs'
cask 'raycast'
cask 'syncthing'
cask 'tableplus'
# cask 'tor-browser'
cask 'visual-studio-code'
cask 'zed'
cask 'zen'
cask 'vlc'

# VPN

# brew 'vpn-slice'
# brew 'openconnect'
